Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_gpio.h
/* -------- GPIO_PVR : (GPIO Offset: 0x060) (R/  32) port Pin Value Register -------- */
#define GPIO_PVR_OFFSET             0x060        /**< \brief (GPIO_PVR offset) Pin Value Register */

#define GPIO_PVR_P0_Pos             0            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P0                 (0x1u << GPIO_PVR_P0_Pos)
#define GPIO_PVR_P1_Pos             1            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P1                 (0x1u << GPIO_PVR_P1_Pos)
#define GPIO_PVR_P2_Pos             2            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P2                 (0x1u << GPIO_PVR_P2_Pos)
#define GPIO_PVR_P3_Pos             3            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P3                 (0x1u << GPIO_PVR_P3_Pos)
#define GPIO_PVR_P4_Pos             4            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P4                 (0x1u << GPIO_PVR_P4_Pos)
#define GPIO_PVR_P5_Pos             5            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P5                 (0x1u << GPIO_PVR_P5_Pos)
#define GPIO_PVR_P6_Pos             6            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P6                 (0x1u << GPIO_PVR_P6_Pos)
#define GPIO_PVR_P7_Pos             7            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P7                 (0x1u << GPIO_PVR_P7_Pos)
#define GPIO_PVR_P8_Pos             8            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P8                 (0x1u << GPIO_PVR_P8_Pos)
#define GPIO_PVR_P9_Pos             9            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P9                 (0x1u << GPIO_PVR_P9_Pos)
#define GPIO_PVR_P10_Pos            10           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P10                (0x1u << GPIO_PVR_P10_Pos)
#define GPIO_PVR_P11_Pos            11           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P11                (0x1u << GPIO_PVR_P11_Pos)
#define GPIO_PVR_P12_Pos            12           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P12                (0x1u << GPIO_PVR_P12_Pos)
#define GPIO_PVR_P13_Pos            13           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P13                (0x1u << GPIO_PVR_P13_Pos)
#define GPIO_PVR_P14_Pos            14           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P14                (0x1u << GPIO_PVR_P14_Pos)
#define GPIO_PVR_P15_Pos            15           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P15                (0x1u << GPIO_PVR_P15_Pos)
#define GPIO_PVR_P16_Pos            16           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P16                (0x1u << GPIO_PVR_P16_Pos)
#define GPIO_PVR_P17_Pos            17           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P17                (0x1u << GPIO_PVR_P17_Pos)
#define GPIO_PVR_P18_Pos            18           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P18                (0x1u << GPIO_PVR_P18_Pos)
#define GPIO_PVR_P19_Pos            19           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P19                (0x1u << GPIO_PVR_P19_Pos)
#define GPIO_PVR_P20_Pos            20           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P20                (0x1u << GPIO_PVR_P20_Pos)
#define GPIO_PVR_P21_Pos            21           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P21                (0x1u << GPIO_PVR_P21_Pos)
#define GPIO_PVR_P22_Pos            22           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P22                (0x1u << GPIO_PVR_P22_Pos)
#define GPIO_PVR_P23_Pos            23           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P23                (0x1u << GPIO_PVR_P23_Pos)
#define GPIO_PVR_P24_Pos            24           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P24                (0x1u << GPIO_PVR_P24_Pos)
#define GPIO_PVR_P25_Pos            25           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P25                (0x1u << GPIO_PVR_P25_Pos)
#define GPIO_PVR_P26_Pos            26           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P26                (0x1u << GPIO_PVR_P26_Pos)
#define GPIO_PVR_P27_Pos            27           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P27                (0x1u << GPIO_PVR_P27_Pos)
#define GPIO_PVR_P28_Pos            28           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P28                (0x1u << GPIO_PVR_P28_Pos)
#define GPIO_PVR_P29_Pos            29           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P29                (0x1u << GPIO_PVR_P29_Pos)
#define GPIO_PVR_P30_Pos            30           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P30                (0x1u << GPIO_PVR_P30_Pos)
#define GPIO_PVR_P31_Pos            31           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P31                (0x1u << GPIO_PVR_P31_Pos)
#define GPIO_PVR_MASK               0xFFFFFFFFu  /**< \brief (GPIO_PVR) MASK Register */

/* -------- GPIO_PUER : (GPIO Offset: 0x070) (R/W 32) port Pull-up Enable Register -------- */
#define GPIO_PUER_OFFSET            0x070        /**< \brief (GPIO_PUER offset) Pull-up Enable Register */

#define GPIO_PUER_P0_Pos            0            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P0                (0x1u << GPIO_PUER_P0_Pos)
#define GPIO_PUER_P1_Pos            1            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P1                (0x1u << GPIO_PUER_P1_Pos)
#define GPIO_PUER_P2_Pos            2            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P2                (0x1u << GPIO_PUER_P2_Pos)
#define GPIO_PUER_P3_Pos            3            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P3                (0x1u << GPIO_PUER_P3_Pos)
#define GPIO_PUER_P4_Pos            4            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P4                (0x1u << GPIO_PUER_P4_Pos)
#define GPIO_PUER_P5_Pos            5            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P5                (0x1u << GPIO_PUER_P5_Pos)
#define GPIO_PUER_P6_Pos            6            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P6                (0x1u << GPIO_PUER_P6_Pos)
#define GPIO_PUER_P7_Pos            7            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P7                (0x1u << GPIO_PUER_P7_Pos)
#define GPIO_PUER_P8_Pos            8            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P8                (0x1u << GPIO_PUER_P8_Pos)
#define GPIO_PUER_P9_Pos            9            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P9                (0x1u << GPIO_PUER_P9_Pos)
#define GPIO_PUER_P10_Pos           10           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P10               (0x1u << GPIO_PUER_P10_Pos)
#define GPIO_PUER_P11_Pos           11           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P11               (0x1u << GPIO_PUER_P11_Pos)
#define GPIO_PUER_P12_Pos           12           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P12               (0x1u << GPIO_PUER_P12_Pos)
#define GPIO_PUER_P13_Pos           13           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P13               (0x1u << GPIO_PUER_P13_Pos)
#define GPIO_PUER_P14_Pos           14           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P14               (0x1u << GPIO_PUER_P14_Pos)
#define GPIO_PUER_P15_Pos           15           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P15               (0x1u << GPIO_PUER_P15_Pos)
#define GPIO_PUER_P16_Pos           16           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P16               (0x1u << GPIO_PUER_P16_Pos)
#define GPIO_PUER_P17_Pos           17           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P17               (0x1u << GPIO_PUER_P17_Pos)
#define GPIO_PUER_P18_Pos           18           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P18               (0x1u << GPIO_PUER_P18_Pos)
#define GPIO_PUER_P19_Pos           19           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P19               (0x1u << GPIO_PUER_P19_Pos)
#define GPIO_PUER_P20_Pos           20           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P20               (0x1u << GPIO_PUER_P20_Pos)
#define GPIO_PUER_P21_Pos           21           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P21               (0x1u << GPIO_PUER_P21_Pos)
#define GPIO_PUER_P22_Pos           22           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P22               (0x1u << GPIO_PUER_P22_Pos)
#define GPIO_PUER_P23_Pos           23           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P23               (0x1u << GPIO_PUER_P23_Pos)
#define GPIO_PUER_P24_Pos           24           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P24               (0x1u << GPIO_PUER_P24_Pos)
#define GPIO_PUER_P25_Pos           25           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P25               (0x1u << GPIO_PUER_P25_Pos)
#define GPIO_PUER_P26_Pos           26           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P26               (0x1u << GPIO_PUER_P26_Pos)
#define GPIO_PUER_P27_Pos           27           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P27               (0x1u << GPIO_PUER_P27_Pos)
#define GPIO_PUER_P28_Pos           28           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P28               (0x1u << GPIO_PUER_P28_Pos)
#define GPIO_PUER_P29_Pos           29           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P29               (0x1u << GPIO_PUER_P29_Pos)
#define GPIO_PUER_P30_Pos           30           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P30               (0x1u << GPIO_PUER_P30_Pos)
#define GPIO_PUER_P31_Pos           31           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P31               (0x1u << GPIO_PUER_P31_Pos)
#define GPIO_PUER_MASK              0xFFFFFFFFu  /**< \brief (GPIO_PUER) MASK Register */

/* -------- GPIO_PUERS : (GPIO Offset: 0x074) ( /W 32) port Pull-up Enable Register - Set -------- */
#define GPIO_PUERS_OFFSET           0x074        /**< \brief (GPIO_PUERS offset) Pull-up Enable Register - Set */

#define GPIO_PUERS_P0_Pos           0            /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P0               (0x1u << GPIO_PUERS_P0_Pos)
#define GPIO_PUERS_P1_Pos           1            /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P1               (0x1u << GPIO_PUERS_P1_Pos)
#define GPIO_PUERS_P2_Pos           2            /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P2               (0x1u << GPIO_PUERS_P2_Pos)
#define GPIO_PUERS_P3_Pos           3            /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P3               (0x1u << GPIO_PUERS_P3_Pos)
#define GPIO_PUERS_P4_Pos           4            /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P4               (0x1u << GPIO_PUERS_P4_Pos)
#define GPIO_PUERS_P5_Pos           5            /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P5               (0x1u << GPIO_PUERS_P5_Pos)
#define GPIO_PUERS_P6_Pos           6            /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P6               (0x1u << GPIO_PUERS_P6_Pos)
#define GPIO_PUERS_P7_Pos           7            /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P7               (0x1u << GPIO_PUERS_P7_Pos)
#define GPIO_PUERS_P8_Pos           8            /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P8               (0x1u << GPIO_PUERS_P8_Pos)
#define GPIO_PUERS_P9_Pos           9            /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P9               (0x1u << GPIO_PUERS_P9_Pos)
#define GPIO_PUERS_P10_Pos          10           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P10              (0x1u << GPIO_PUERS_P10_Pos)
#define GPIO_PUERS_P11_Pos          11           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P11              (0x1u << GPIO_PUERS_P11_Pos)
#define GPIO_PUERS_P12_Pos          12           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P12              (0x1u << GPIO_PUERS_P12_Pos)
#define GPIO_PUERS_P13_Pos          13           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P13              (0x1u << GPIO_PUERS_P13_Pos)
#define GPIO_PUERS_P14_Pos          14           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P14              (0x1u << GPIO_PUERS_P14_Pos)
#define GPIO_PUERS_P15_Pos          15           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P15              (0x1u << GPIO_PUERS_P15_Pos)
#define GPIO_PUERS_P16_Pos          16           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P16              (0x1u << GPIO_PUERS_P16_Pos)
#define GPIO_PUERS_P17_Pos          17           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P17              (0x1u << GPIO_PUERS_P17_Pos)
#define GPIO_PUERS_P18_Pos          18           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P18              (0x1u << GPIO_PUERS_P18_Pos)
#define GPIO_PUERS_P19_Pos          19           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P19              (0x1u << GPIO_PUERS_P19_Pos)
#define GPIO_PUERS_P20_Pos          20           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P20              (0x1u << GPIO_PUERS_P20_Pos)
#define GPIO_PUERS_P21_Pos          21           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P21              (0x1u << GPIO_PUERS_P21_Pos)
#define GPIO_PUERS_P22_Pos          22           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P22              (0x1u << GPIO_PUERS_P22_Pos)
#define GPIO_PUERS_P23_Pos          23           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P23              (0x1u << GPIO_PUERS_P23_Pos)
#define GPIO_PUERS_P24_Pos          24           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P24              (0x1u << GPIO_PUERS_P24_Pos)
#define GPIO_PUERS_P25_Pos          25           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P25              (0x1u << GPIO_PUERS_P25_Pos)
#define GPIO_PUERS_P26_Pos          26           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P26              (0x1u << GPIO_PUERS_P26_Pos)
#define GPIO_PUERS_P27_Pos          27           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P27              (0x1u << GPIO_PUERS_P27_Pos)
#define GPIO_PUERS_P28_Pos          28           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P28              (0x1u << GPIO_PUERS_P28_Pos)
#define GPIO_PUERS_P29_Pos          29           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P29              (0x1u << GPIO_PUERS_P29_Pos)
#define GPIO_PUERS_P30_Pos          30           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P30              (0x1u << GPIO_PUERS_P30_Pos)
#define GPIO_PUERS_P31_Pos          31           /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P31              (0x1u << GPIO_PUERS_P31_Pos)
#define GPIO_PUERS_MASK             0xFFFFFFFFu  /**< \brief (GPIO_PUERS) MASK Register */

