Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_gpio.h
#define GPIO_IER_P0_Pos             0            /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P0                 (0x1u << GPIO_IER_P0_Pos)
#define GPIO_IER_P1_Pos             1            /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P1                 (0x1u << GPIO_IER_P1_Pos)
#define GPIO_IER_P2_Pos             2            /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P2                 (0x1u << GPIO_IER_P2_Pos)
#define GPIO_IER_P3_Pos             3            /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P3                 (0x1u << GPIO_IER_P3_Pos)
#define GPIO_IER_P4_Pos             4            /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P4                 (0x1u << GPIO_IER_P4_Pos)
#define GPIO_IER_P5_Pos             5            /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P5                 (0x1u << GPIO_IER_P5_Pos)
#define GPIO_IER_P6_Pos             6            /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P6                 (0x1u << GPIO_IER_P6_Pos)
#define GPIO_IER_P7_Pos             7            /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P7                 (0x1u << GPIO_IER_P7_Pos)
#define GPIO_IER_P8_Pos             8            /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P8                 (0x1u << GPIO_IER_P8_Pos)
#define GPIO_IER_P9_Pos             9            /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P9                 (0x1u << GPIO_IER_P9_Pos)
#define GPIO_IER_P10_Pos            10           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P10                (0x1u << GPIO_IER_P10_Pos)
#define GPIO_IER_P11_Pos            11           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P11                (0x1u << GPIO_IER_P11_Pos)
#define GPIO_IER_P12_Pos            12           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P12                (0x1u << GPIO_IER_P12_Pos)
#define GPIO_IER_P13_Pos            13           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P13                (0x1u << GPIO_IER_P13_Pos)
#define GPIO_IER_P14_Pos            14           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P14                (0x1u << GPIO_IER_P14_Pos)
#define GPIO_IER_P15_Pos            15           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P15                (0x1u << GPIO_IER_P15_Pos)
#define GPIO_IER_P16_Pos            16           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P16                (0x1u << GPIO_IER_P16_Pos)
#define GPIO_IER_P17_Pos            17           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P17                (0x1u << GPIO_IER_P17_Pos)
#define GPIO_IER_P18_Pos            18           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P18                (0x1u << GPIO_IER_P18_Pos)
#define GPIO_IER_P19_Pos            19           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P19                (0x1u << GPIO_IER_P19_Pos)
#define GPIO_IER_P20_Pos            20           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P20                (0x1u << GPIO_IER_P20_Pos)
#define GPIO_IER_P21_Pos            21           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P21                (0x1u << GPIO_IER_P21_Pos)
#define GPIO_IER_P22_Pos            22           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P22                (0x1u << GPIO_IER_P22_Pos)
#define GPIO_IER_P23_Pos            23           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P23                (0x1u << GPIO_IER_P23_Pos)
#define GPIO_IER_P24_Pos            24           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P24                (0x1u << GPIO_IER_P24_Pos)
#define GPIO_IER_P25_Pos            25           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P25                (0x1u << GPIO_IER_P25_Pos)
#define GPIO_IER_P26_Pos            26           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P26                (0x1u << GPIO_IER_P26_Pos)
#define GPIO_IER_P27_Pos            27           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P27                (0x1u << GPIO_IER_P27_Pos)
#define GPIO_IER_P28_Pos            28           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P28                (0x1u << GPIO_IER_P28_Pos)
#define GPIO_IER_P29_Pos            29           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P29                (0x1u << GPIO_IER_P29_Pos)
#define GPIO_IER_P30_Pos            30           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P30                (0x1u << GPIO_IER_P30_Pos)
#define GPIO_IER_P31_Pos            31           /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P31                (0x1u << GPIO_IER_P31_Pos)
#define GPIO_IER_MASK               0xFFFFFFFFu  /**< \brief (GPIO_IER) MASK Register */

/* -------- GPIO_IERS : (GPIO Offset: 0x094) ( /W 32) port Interrupt Enable Register - Set -------- */
#define GPIO_IERS_OFFSET            0x094        /**< \brief (GPIO_IERS offset) Interrupt Enable Register - Set */

#define GPIO_IERS_P0_Pos            0            /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P0                (0x1u << GPIO_IERS_P0_Pos)
#define GPIO_IERS_P1_Pos            1            /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P1                (0x1u << GPIO_IERS_P1_Pos)
#define GPIO_IERS_P2_Pos            2            /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P2                (0x1u << GPIO_IERS_P2_Pos)
#define GPIO_IERS_P3_Pos            3            /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P3                (0x1u << GPIO_IERS_P3_Pos)
#define GPIO_IERS_P4_Pos            4            /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P4                (0x1u << GPIO_IERS_P4_Pos)
#define GPIO_IERS_P5_Pos            5            /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P5                (0x1u << GPIO_IERS_P5_Pos)
#define GPIO_IERS_P6_Pos            6            /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P6                (0x1u << GPIO_IERS_P6_Pos)
#define GPIO_IERS_P7_Pos            7            /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P7                (0x1u << GPIO_IERS_P7_Pos)
#define GPIO_IERS_P8_Pos            8            /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P8                (0x1u << GPIO_IERS_P8_Pos)
#define GPIO_IERS_P9_Pos            9            /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P9                (0x1u << GPIO_IERS_P9_Pos)
#define GPIO_IERS_P10_Pos           10           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P10               (0x1u << GPIO_IERS_P10_Pos)
#define GPIO_IERS_P11_Pos           11           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P11               (0x1u << GPIO_IERS_P11_Pos)
#define GPIO_IERS_P12_Pos           12           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P12               (0x1u << GPIO_IERS_P12_Pos)
#define GPIO_IERS_P13_Pos           13           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P13               (0x1u << GPIO_IERS_P13_Pos)
#define GPIO_IERS_P14_Pos           14           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P14               (0x1u << GPIO_IERS_P14_Pos)
#define GPIO_IERS_P15_Pos           15           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P15               (0x1u << GPIO_IERS_P15_Pos)
#define GPIO_IERS_P16_Pos           16           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P16               (0x1u << GPIO_IERS_P16_Pos)
#define GPIO_IERS_P17_Pos           17           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P17               (0x1u << GPIO_IERS_P17_Pos)
#define GPIO_IERS_P18_Pos           18           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P18               (0x1u << GPIO_IERS_P18_Pos)
#define GPIO_IERS_P19_Pos           19           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P19               (0x1u << GPIO_IERS_P19_Pos)
#define GPIO_IERS_P20_Pos           20           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P20               (0x1u << GPIO_IERS_P20_Pos)
#define GPIO_IERS_P21_Pos           21           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P21               (0x1u << GPIO_IERS_P21_Pos)
#define GPIO_IERS_P22_Pos           22           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P22               (0x1u << GPIO_IERS_P22_Pos)
#define GPIO_IERS_P23_Pos           23           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P23               (0x1u << GPIO_IERS_P23_Pos)
#define GPIO_IERS_P24_Pos           24           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P24               (0x1u << GPIO_IERS_P24_Pos)
#define GPIO_IERS_P25_Pos           25           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P25               (0x1u << GPIO_IERS_P25_Pos)
#define GPIO_IERS_P26_Pos           26           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P26               (0x1u << GPIO_IERS_P26_Pos)
#define GPIO_IERS_P27_Pos           27           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P27               (0x1u << GPIO_IERS_P27_Pos)
#define GPIO_IERS_P28_Pos           28           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P28               (0x1u << GPIO_IERS_P28_Pos)
#define GPIO_IERS_P29_Pos           29           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P29               (0x1u << GPIO_IERS_P29_Pos)
#define GPIO_IERS_P30_Pos           30           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P30               (0x1u << GPIO_IERS_P30_Pos)
#define GPIO_IERS_P31_Pos           31           /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P31               (0x1u << GPIO_IERS_P31_Pos)
#define GPIO_IERS_MASK              0xFFFFFFFFu  /**< \brief (GPIO_IERS) MASK Register */

/* -------- GPIO_IERC : (GPIO Offset: 0x098) ( /W 32) port Interrupt Enable Register - Clear -------- */
#define GPIO_IERC_OFFSET            0x098        /**< \brief (GPIO_IERC offset) Interrupt Enable Register - Clear */

#define GPIO_IERC_P0_Pos            0            /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P0                (0x1u << GPIO_IERC_P0_Pos)
#define GPIO_IERC_P1_Pos            1            /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P1                (0x1u << GPIO_IERC_P1_Pos)
#define GPIO_IERC_P2_Pos            2            /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P2                (0x1u << GPIO_IERC_P2_Pos)
#define GPIO_IERC_P3_Pos            3            /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P3                (0x1u << GPIO_IERC_P3_Pos)
#define GPIO_IERC_P4_Pos            4            /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P4                (0x1u << GPIO_IERC_P4_Pos)
#define GPIO_IERC_P5_Pos            5            /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P5                (0x1u << GPIO_IERC_P5_Pos)
#define GPIO_IERC_P6_Pos            6            /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P6                (0x1u << GPIO_IERC_P6_Pos)
#define GPIO_IERC_P7_Pos            7            /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P7                (0x1u << GPIO_IERC_P7_Pos)
#define GPIO_IERC_P8_Pos            8            /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P8                (0x1u << GPIO_IERC_P8_Pos)
#define GPIO_IERC_P9_Pos            9            /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P9                (0x1u << GPIO_IERC_P9_Pos)
#define GPIO_IERC_P10_Pos           10           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P10               (0x1u << GPIO_IERC_P10_Pos)
#define GPIO_IERC_P11_Pos           11           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P11               (0x1u << GPIO_IERC_P11_Pos)
#define GPIO_IERC_P12_Pos           12           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P12               (0x1u << GPIO_IERC_P12_Pos)
#define GPIO_IERC_P13_Pos           13           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P13               (0x1u << GPIO_IERC_P13_Pos)
#define GPIO_IERC_P14_Pos           14           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P14               (0x1u << GPIO_IERC_P14_Pos)
#define GPIO_IERC_P15_Pos           15           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P15               (0x1u << GPIO_IERC_P15_Pos)
#define GPIO_IERC_P16_Pos           16           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P16               (0x1u << GPIO_IERC_P16_Pos)
#define GPIO_IERC_P17_Pos           17           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P17               (0x1u << GPIO_IERC_P17_Pos)
#define GPIO_IERC_P18_Pos           18           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P18               (0x1u << GPIO_IERC_P18_Pos)
#define GPIO_IERC_P19_Pos           19           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P19               (0x1u << GPIO_IERC_P19_Pos)
#define GPIO_IERC_P20_Pos           20           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P20               (0x1u << GPIO_IERC_P20_Pos)
#define GPIO_IERC_P21_Pos           21           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P21               (0x1u << GPIO_IERC_P21_Pos)
#define GPIO_IERC_P22_Pos           22           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P22               (0x1u << GPIO_IERC_P22_Pos)
#define GPIO_IERC_P23_Pos           23           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P23               (0x1u << GPIO_IERC_P23_Pos)
#define GPIO_IERC_P24_Pos           24           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P24               (0x1u << GPIO_IERC_P24_Pos)
#define GPIO_IERC_P25_Pos           25           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P25               (0x1u << GPIO_IERC_P25_Pos)
#define GPIO_IERC_P26_Pos           26           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P26               (0x1u << GPIO_IERC_P26_Pos)
#define GPIO_IERC_P27_Pos           27           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P27               (0x1u << GPIO_IERC_P27_Pos)
#define GPIO_IERC_P28_Pos           28           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P28               (0x1u << GPIO_IERC_P28_Pos)
#define GPIO_IERC_P29_Pos           29           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P29               (0x1u << GPIO_IERC_P29_Pos)
#define GPIO_IERC_P30_Pos           30           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P30               (0x1u << GPIO_IERC_P30_Pos)
#define GPIO_IERC_P31_Pos           31           /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P31               (0x1u << GPIO_IERC_P31_Pos)
#define GPIO_IERC_MASK              0xFFFFFFFFu  /**< \brief (GPIO_IERC) MASK Register */

/* -------- GPIO_IERT : (GPIO Offset: 0x09C) ( /W 32) port Interrupt Enable Register - Toggle -------- */
#define GPIO_IERT_OFFSET            0x09C        /**< \brief (GPIO_IERT offset) Interrupt Enable Register - Toggle */

#define GPIO_IERT_P0_Pos            0            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P0                (0x1u << GPIO_IERT_P0_Pos)
#define GPIO_IERT_P1_Pos            1            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P1                (0x1u << GPIO_IERT_P1_Pos)
#define GPIO_IERT_P2_Pos            2            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P2                (0x1u << GPIO_IERT_P2_Pos)
#define GPIO_IERT_P3_Pos            3            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P3                (0x1u << GPIO_IERT_P3_Pos)
#define GPIO_IERT_P4_Pos            4            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P4                (0x1u << GPIO_IERT_P4_Pos)
#define GPIO_IERT_P5_Pos            5            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P5                (0x1u << GPIO_IERT_P5_Pos)
#define GPIO_IERT_P6_Pos            6            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P6                (0x1u << GPIO_IERT_P6_Pos)
#define GPIO_IERT_P7_Pos            7            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P7                (0x1u << GPIO_IERT_P7_Pos)
#define GPIO_IERT_P8_Pos            8            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P8                (0x1u << GPIO_IERT_P8_Pos)
#define GPIO_IERT_P9_Pos            9            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P9                (0x1u << GPIO_IERT_P9_Pos)
#define GPIO_IERT_P10_Pos           10           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P10               (0x1u << GPIO_IERT_P10_Pos)
#define GPIO_IERT_P11_Pos           11           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P11               (0x1u << GPIO_IERT_P11_Pos)
#define GPIO_IERT_P12_Pos           12           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P12               (0x1u << GPIO_IERT_P12_Pos)
#define GPIO_IERT_P13_Pos           13           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P13               (0x1u << GPIO_IERT_P13_Pos)
#define GPIO_IERT_P14_Pos           14           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P14               (0x1u << GPIO_IERT_P14_Pos)
#define GPIO_IERT_P15_Pos           15           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P15               (0x1u << GPIO_IERT_P15_Pos)
#define GPIO_IERT_P16_Pos           16           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P16               (0x1u << GPIO_IERT_P16_Pos)
#define GPIO_IERT_P17_Pos           17           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P17               (0x1u << GPIO_IERT_P17_Pos)
#define GPIO_IERT_P18_Pos           18           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P18               (0x1u << GPIO_IERT_P18_Pos)
#define GPIO_IERT_P19_Pos           19           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P19               (0x1u << GPIO_IERT_P19_Pos)
#define GPIO_IERT_P20_Pos           20           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P20               (0x1u << GPIO_IERT_P20_Pos)
#define GPIO_IERT_P21_Pos           21           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P21               (0x1u << GPIO_IERT_P21_Pos)
#define GPIO_IERT_P22_Pos           22           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P22               (0x1u << GPIO_IERT_P22_Pos)
#define GPIO_IERT_P23_Pos           23           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P23               (0x1u << GPIO_IERT_P23_Pos)
#define GPIO_IERT_P24_Pos           24           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P24               (0x1u << GPIO_IERT_P24_Pos)
#define GPIO_IERT_P25_Pos           25           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P25               (0x1u << GPIO_IERT_P25_Pos)
#define GPIO_IERT_P26_Pos           26           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P26               (0x1u << GPIO_IERT_P26_Pos)
#define GPIO_IERT_P27_Pos           27           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P27               (0x1u << GPIO_IERT_P27_Pos)
#define GPIO_IERT_P28_Pos           28           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P28               (0x1u << GPIO_IERT_P28_Pos)
#define GPIO_IERT_P29_Pos           29           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P29               (0x1u << GPIO_IERT_P29_Pos)
#define GPIO_IERT_P30_Pos           30           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P30               (0x1u << GPIO_IERT_P30_Pos)
#define GPIO_IERT_P31_Pos           31           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P31               (0x1u << GPIO_IERT_P31_Pos)
#define GPIO_IERT_MASK              0xFFFFFFFFu  /**< \brief (GPIO_IERT) MASK Register */

