Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_gpio.h
/* -------- GPIO_EVERC : (GPIO Offset: 0x188) ( /W 32) port Event Enable Register - Clear -------- */
#define GPIO_EVERC_OFFSET           0x188        /**< \brief (GPIO_EVERC offset) Event Enable Register - Clear */

#define GPIO_EVERC_P0_Pos           0            /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P0               (0x1u << GPIO_EVERC_P0_Pos)
#define GPIO_EVERC_P1_Pos           1            /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P1               (0x1u << GPIO_EVERC_P1_Pos)
#define GPIO_EVERC_P2_Pos           2            /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P2               (0x1u << GPIO_EVERC_P2_Pos)
#define GPIO_EVERC_P3_Pos           3            /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P3               (0x1u << GPIO_EVERC_P3_Pos)
#define GPIO_EVERC_P4_Pos           4            /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P4               (0x1u << GPIO_EVERC_P4_Pos)
#define GPIO_EVERC_P5_Pos           5            /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P5               (0x1u << GPIO_EVERC_P5_Pos)
#define GPIO_EVERC_P6_Pos           6            /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P6               (0x1u << GPIO_EVERC_P6_Pos)
#define GPIO_EVERC_P7_Pos           7            /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P7               (0x1u << GPIO_EVERC_P7_Pos)
#define GPIO_EVERC_P8_Pos           8            /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P8               (0x1u << GPIO_EVERC_P8_Pos)
#define GPIO_EVERC_P9_Pos           9            /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P9               (0x1u << GPIO_EVERC_P9_Pos)
#define GPIO_EVERC_P10_Pos          10           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P10              (0x1u << GPIO_EVERC_P10_Pos)
#define GPIO_EVERC_P11_Pos          11           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P11              (0x1u << GPIO_EVERC_P11_Pos)
#define GPIO_EVERC_P12_Pos          12           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P12              (0x1u << GPIO_EVERC_P12_Pos)
#define GPIO_EVERC_P13_Pos          13           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P13              (0x1u << GPIO_EVERC_P13_Pos)
#define GPIO_EVERC_P14_Pos          14           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P14              (0x1u << GPIO_EVERC_P14_Pos)
#define GPIO_EVERC_P15_Pos          15           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P15              (0x1u << GPIO_EVERC_P15_Pos)
#define GPIO_EVERC_P16_Pos          16           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P16              (0x1u << GPIO_EVERC_P16_Pos)
#define GPIO_EVERC_P17_Pos          17           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P17              (0x1u << GPIO_EVERC_P17_Pos)
#define GPIO_EVERC_P18_Pos          18           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P18              (0x1u << GPIO_EVERC_P18_Pos)
#define GPIO_EVERC_P19_Pos          19           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P19              (0x1u << GPIO_EVERC_P19_Pos)
#define GPIO_EVERC_P20_Pos          20           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P20              (0x1u << GPIO_EVERC_P20_Pos)
#define GPIO_EVERC_P21_Pos          21           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P21              (0x1u << GPIO_EVERC_P21_Pos)
#define GPIO_EVERC_P22_Pos          22           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P22              (0x1u << GPIO_EVERC_P22_Pos)
#define GPIO_EVERC_P23_Pos          23           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P23              (0x1u << GPIO_EVERC_P23_Pos)
#define GPIO_EVERC_P24_Pos          24           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P24              (0x1u << GPIO_EVERC_P24_Pos)
#define GPIO_EVERC_P25_Pos          25           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P25              (0x1u << GPIO_EVERC_P25_Pos)
#define GPIO_EVERC_P26_Pos          26           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P26              (0x1u << GPIO_EVERC_P26_Pos)
#define GPIO_EVERC_P27_Pos          27           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P27              (0x1u << GPIO_EVERC_P27_Pos)
#define GPIO_EVERC_P28_Pos          28           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P28              (0x1u << GPIO_EVERC_P28_Pos)
#define GPIO_EVERC_P29_Pos          29           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P29              (0x1u << GPIO_EVERC_P29_Pos)
#define GPIO_EVERC_P30_Pos          30           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P30              (0x1u << GPIO_EVERC_P30_Pos)
#define GPIO_EVERC_P31_Pos          31           /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P31              (0x1u << GPIO_EVERC_P31_Pos)
#define GPIO_EVERC_MASK             0xFFFFFFFFu  /**< \brief (GPIO_EVERC) MASK Register */

/* -------- GPIO_EVERT : (GPIO Offset: 0x18C) ( /W 32) port Event Enable Register - Toggle -------- */
#define GPIO_EVERT_OFFSET           0x18C        /**< \brief (GPIO_EVERT offset) Event Enable Register - Toggle */

#define GPIO_EVERT_P0_Pos           0            /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P0               (0x1u << GPIO_EVERT_P0_Pos)
#define GPIO_EVERT_P1_Pos           1            /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P1               (0x1u << GPIO_EVERT_P1_Pos)
#define GPIO_EVERT_P2_Pos           2            /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P2               (0x1u << GPIO_EVERT_P2_Pos)
#define GPIO_EVERT_P3_Pos           3            /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P3               (0x1u << GPIO_EVERT_P3_Pos)
#define GPIO_EVERT_P4_Pos           4            /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P4               (0x1u << GPIO_EVERT_P4_Pos)
#define GPIO_EVERT_P5_Pos           5            /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P5               (0x1u << GPIO_EVERT_P5_Pos)
#define GPIO_EVERT_P6_Pos           6            /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P6               (0x1u << GPIO_EVERT_P6_Pos)
#define GPIO_EVERT_P7_Pos           7            /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P7               (0x1u << GPIO_EVERT_P7_Pos)
#define GPIO_EVERT_P8_Pos           8            /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P8               (0x1u << GPIO_EVERT_P8_Pos)
#define GPIO_EVERT_P9_Pos           9            /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P9               (0x1u << GPIO_EVERT_P9_Pos)
#define GPIO_EVERT_P10_Pos          10           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P10              (0x1u << GPIO_EVERT_P10_Pos)
#define GPIO_EVERT_P11_Pos          11           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P11              (0x1u << GPIO_EVERT_P11_Pos)
#define GPIO_EVERT_P12_Pos          12           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P12              (0x1u << GPIO_EVERT_P12_Pos)
#define GPIO_EVERT_P13_Pos          13           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P13              (0x1u << GPIO_EVERT_P13_Pos)
#define GPIO_EVERT_P14_Pos          14           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P14              (0x1u << GPIO_EVERT_P14_Pos)
#define GPIO_EVERT_P15_Pos          15           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P15              (0x1u << GPIO_EVERT_P15_Pos)
#define GPIO_EVERT_P16_Pos          16           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P16              (0x1u << GPIO_EVERT_P16_Pos)
#define GPIO_EVERT_P17_Pos          17           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P17              (0x1u << GPIO_EVERT_P17_Pos)
#define GPIO_EVERT_P18_Pos          18           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P18              (0x1u << GPIO_EVERT_P18_Pos)
#define GPIO_EVERT_P19_Pos          19           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P19              (0x1u << GPIO_EVERT_P19_Pos)
#define GPIO_EVERT_P20_Pos          20           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P20              (0x1u << GPIO_EVERT_P20_Pos)
#define GPIO_EVERT_P21_Pos          21           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P21              (0x1u << GPIO_EVERT_P21_Pos)
#define GPIO_EVERT_P22_Pos          22           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P22              (0x1u << GPIO_EVERT_P22_Pos)
#define GPIO_EVERT_P23_Pos          23           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P23              (0x1u << GPIO_EVERT_P23_Pos)
#define GPIO_EVERT_P24_Pos          24           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P24              (0x1u << GPIO_EVERT_P24_Pos)
#define GPIO_EVERT_P25_Pos          25           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P25              (0x1u << GPIO_EVERT_P25_Pos)
#define GPIO_EVERT_P26_Pos          26           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P26              (0x1u << GPIO_EVERT_P26_Pos)
#define GPIO_EVERT_P27_Pos          27           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P27              (0x1u << GPIO_EVERT_P27_Pos)
#define GPIO_EVERT_P28_Pos          28           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P28              (0x1u << GPIO_EVERT_P28_Pos)
#define GPIO_EVERT_P29_Pos          29           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P29              (0x1u << GPIO_EVERT_P29_Pos)
#define GPIO_EVERT_P30_Pos          30           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P30              (0x1u << GPIO_EVERT_P30_Pos)
#define GPIO_EVERT_P31_Pos          31           /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P31              (0x1u << GPIO_EVERT_P31_Pos)
#define GPIO_EVERT_MASK             0xFFFFFFFFu  /**< \brief (GPIO_EVERT) MASK Register */

/* -------- GPIO_LOCK : (GPIO Offset: 0x1A0) (R/W 32) port Lock Register -------- */
#define GPIO_LOCK_OFFSET            0x1A0        /**< \brief (GPIO_LOCK offset) Lock Register */

#define GPIO_LOCK_P0_Pos            0            /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P0                (0x1u << GPIO_LOCK_P0_Pos)
#define GPIO_LOCK_P1_Pos            1            /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P1                (0x1u << GPIO_LOCK_P1_Pos)
#define GPIO_LOCK_P2_Pos            2            /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P2                (0x1u << GPIO_LOCK_P2_Pos)
#define GPIO_LOCK_P3_Pos            3            /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P3                (0x1u << GPIO_LOCK_P3_Pos)
#define GPIO_LOCK_P4_Pos            4            /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P4                (0x1u << GPIO_LOCK_P4_Pos)
#define GPIO_LOCK_P5_Pos            5            /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P5                (0x1u << GPIO_LOCK_P5_Pos)
#define GPIO_LOCK_P6_Pos            6            /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P6                (0x1u << GPIO_LOCK_P6_Pos)
#define GPIO_LOCK_P7_Pos            7            /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P7                (0x1u << GPIO_LOCK_P7_Pos)
#define GPIO_LOCK_P8_Pos            8            /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P8                (0x1u << GPIO_LOCK_P8_Pos)
#define GPIO_LOCK_P9_Pos            9            /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P9                (0x1u << GPIO_LOCK_P9_Pos)
#define GPIO_LOCK_P10_Pos           10           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P10               (0x1u << GPIO_LOCK_P10_Pos)
#define GPIO_LOCK_P11_Pos           11           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P11               (0x1u << GPIO_LOCK_P11_Pos)
#define GPIO_LOCK_P12_Pos           12           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P12               (0x1u << GPIO_LOCK_P12_Pos)
#define GPIO_LOCK_P13_Pos           13           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P13               (0x1u << GPIO_LOCK_P13_Pos)
#define GPIO_LOCK_P14_Pos           14           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P14               (0x1u << GPIO_LOCK_P14_Pos)
#define GPIO_LOCK_P15_Pos           15           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P15               (0x1u << GPIO_LOCK_P15_Pos)
#define GPIO_LOCK_P16_Pos           16           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P16               (0x1u << GPIO_LOCK_P16_Pos)
#define GPIO_LOCK_P17_Pos           17           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P17               (0x1u << GPIO_LOCK_P17_Pos)
#define GPIO_LOCK_P18_Pos           18           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P18               (0x1u << GPIO_LOCK_P18_Pos)
#define GPIO_LOCK_P19_Pos           19           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P19               (0x1u << GPIO_LOCK_P19_Pos)
#define GPIO_LOCK_P20_Pos           20           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P20               (0x1u << GPIO_LOCK_P20_Pos)
#define GPIO_LOCK_P21_Pos           21           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P21               (0x1u << GPIO_LOCK_P21_Pos)
#define GPIO_LOCK_P22_Pos           22           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P22               (0x1u << GPIO_LOCK_P22_Pos)
#define GPIO_LOCK_P23_Pos           23           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P23               (0x1u << GPIO_LOCK_P23_Pos)
#define GPIO_LOCK_P24_Pos           24           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P24               (0x1u << GPIO_LOCK_P24_Pos)
#define GPIO_LOCK_P25_Pos           25           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P25               (0x1u << GPIO_LOCK_P25_Pos)
#define GPIO_LOCK_P26_Pos           26           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P26               (0x1u << GPIO_LOCK_P26_Pos)
#define GPIO_LOCK_P27_Pos           27           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P27               (0x1u << GPIO_LOCK_P27_Pos)
#define GPIO_LOCK_P28_Pos           28           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P28               (0x1u << GPIO_LOCK_P28_Pos)
#define GPIO_LOCK_P29_Pos           29           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P29               (0x1u << GPIO_LOCK_P29_Pos)
#define GPIO_LOCK_P30_Pos           30           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P30               (0x1u << GPIO_LOCK_P30_Pos)
#define GPIO_LOCK_P31_Pos           31           /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P31               (0x1u << GPIO_LOCK_P31_Pos)
#define GPIO_LOCK_MASK              0xFFFFFFFFu  /**< \brief (GPIO_LOCK) MASK Register */

/* -------- GPIO_LOCKS : (GPIO Offset: 0x1A4) ( /W 32) port Lock Register - Set -------- */
#define GPIO_LOCKS_OFFSET           0x1A4        /**< \brief (GPIO_LOCKS offset) Lock Register - Set */

